In [1]:
# Importer les librairies
# Calcul, manipulation et visualisation
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt


# Importer le dataset
dataset = pd.read_csv('Salary_Data.csv')

In [2]:
#Rapide résumé du dataframe: nombre de colonnes et nombre de lignes
dataset.shape

(30, 2)

In [3]:
# Connaitre le nom des colonnes
dataset.columns

list(dataset.columns.values)

['YearsExperience', 'Salary']

In [4]:
# Visualiser les premières lignes
dataset.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [5]:
# Visualiser les premières lignes
dataset.head(20)

    YearsExperience   Salary
0               1.1  39343.0
1               1.3  46205.0
2               1.5  37731.0
3               2.0  43525.0
4               2.2  39891.0
5               2.9  56642.0
6               3.0  60150.0
7               3.2  54445.0
8               3.2  64445.0
9               3.7  57189.0
10              3.9  63218.0
11              4.0  55794.0
12              4.0  56957.0
13              4.1  57081.0
14              4.5  61111.0
15              4.9  67938.0
16              5.1  66029.0
17              5.3  83088.0
18              5.9  81363.0
19              6.0  93940.0

In [6]:
# Type des colonnes
dataset.dtypes

YearsExperience    float64
Salary             float64
dtype: object

In [7]:
dataset_qual=dataset.select_dtypes(exclude=['object'])
# dataset_qual.drop('CustomerID', axis=1, inplace=True)
dataset_qual.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [8]:
# removing null values to avoid errors  
dataset.dropna(inplace = True)

In [9]:
# percentile list 
perc =[.20, .40, .60, .80] 

# list of dtypes to include 
include =['object', 'float', 'int64']

In [10]:
# calling describe method 
desc = dataset.describe(percentiles = perc, include = include)

In [11]:
desc

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
20%           2.980000   55524.200000
40%           4.000000   60726.600000
50%           4.700000   65237.000000
60%           5.540000   82053.000000
80%           8.300000  106351.800000
max          10.500000  122391.000000

In [12]:
# graphiques
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.offline as py
import plotly.graph_objs as go
from plotly.offline import download_plotlyjs, init_notebook_mode, plot, iplot
import plotly.tools as tls
import plotly.figure_factory as ff
py.init_notebook_mode(connected=True)
plt.style.use('fivethirtyeight')
%matplotlib inline

ModuleNotFoundError: No module named 'plotly'

In [ ]:
# Dummification et imputatation
from sklearn.preprocessing import StandardScaler, LabelEncoder
from sklearn.model_selection import train_test_split #Partitionnement de la dataset
from sklearn.preprocessing import Imputer #Pour l'imputation des valeurs manquante
#Pas de message d'alertes
import warnings
warnings.filterwarnings('ignore')
pd.options.mode.chained_assignment = None #masque les avertissements de pandas

In [ ]:
dataset_qual=dataset.select_dtypes(exclude=['object'])
dataset_qual.drop('CustomerID', axis=1, inplace=True)
dataset_qual.describe().plot(kind = "area",fontsize=22, figsize = (18,8), table = True,colormap="rainbow")
plt.xlabel('',)
plt.ylabel('Value')
plt.title("Statistiques générales des variables ")

In [ ]:
#Verifier les valeurs manquantes
vars_with_missing = []
for f in dataset.columns:
    missings = dataset[dataset[f] == -1][f].count()
    if missings > 0:
        vars_with_missing.append(f)
        missings_perc = missings/dataset.shape[0]

        print('La Variable {} a enregistré {} ({:.2%}) valeurs manquantes'.format(f, missings, missings_perc))

print('En total, il a {} variables avec des valeurs manquantes'.format(len(vars_with_missing)))

In [ ]:
# description d'une variable qualitative
dataset['Genre'].describe(), dataset['Genre'].head()

In [ ]:
dataset.describe().transpose()

In [ ]:
# Visualiser des données : graphe Genre * Sexe
a = sns.FacetGrid( dataset, hue = 'Genre', aspect=4 )
a.map(sns.kdeplot, 'Age', shade= True )
a.set(xlim=(0 , dataset['Age'].max()))
a.add_legend()

In [ ]:
#Visualiser des graphes - librairie seaborn
f,ax=plt.subplots(1,2,figsize=(16,7))
dataset['Genre'].value_counts().plot.pie(explode=[0.1,0.1],autopct='%1.1f%%',ax=ax[0],shadow =True)
ax[0].set_title('Cible Count')
ax[0].set_ylabel('Count')
sns.countplot('Genre',data=dataset,ax=ax[1])
ax[1].set_title('Cible Count')
plt.show()

In [ ]:
plt.figure(figsize=(15,10))
plt.subplot(2,2,1)
sns.boxenplot(x='Genre',y='Age',data=dataset)
plt.subplot(2,2,2)
sns.boxenplot(x='Genre',y='Annual Income (k$)',data=dataset)
plt.subplot(2,2,3)
sns.violinplot(x='Genre',y='Spending Score (1-100)',data=dataset)

In [ ]:
# Visualiser plusieurs types de représentations selon une variable cible
sns.pairplot(dataset,hue='Genre')

In [ ]:
dataset.corr()

In [ ]:
sns.lmplot(x='Annual Income (k$)', y='Spending Score (1-100)', data=dataset, hue='Genre', palette='Set1', scatter_kws={'alpha':0.3})

In [ ]:
# examiner une seule variable
print(dataset['Age'].unique())
print(dataset['Age'].value_counts(sort = True))
print(dataset['Age'].describe())